// filtersConfig.ts

// Категории и типы
export const CATEGORY_TYPES: Record<string, string[]> = {
  Комерційна: [
    "Офіс",
    "Торгівельна площа",
    "Виробниче приміщення",
    "Склад Складське приміщення",
    "Ресторан, кафе Об’єкт сфери харчування",
    "Готель Готельний номер",
    "Магазин",
    "Окрема Будівля Ціла будівля",
    "СТО",
    "АЗС",
    "Автомийка",
    "Паркомісце/Гараж",
  ],
  Житлова: ["Квартира", "Будинок"],
};

// Фильтры по типу недвижимости (без локации)
export const FILTERS_BY_TYPE: Record<string, string[]> = {
  Офіс: ["Ціна", "Поверх", "Поверховість", "Загальна площа"],
  "Торгівельна площа": ["Ціна", "Поверх", "Поверховість", "Загальна площа"],
  "Виробниче приміщення": ["Ціна", "Поверх", "Поверховість", "Загальна площа"],
  "Склад Складське приміщення": [
    "Ціна",
    "Поверх",
    "Поверховість",
    "Загальна площа",
  ],
  "Ресторан, кафе Об’єкт сфери харчування": [
    "Ціна",
    "Поверх",
    "Поверховість",
    "Загальна площа",
  ],
  "Готель Готельний номер": [
    "Ціна",
    "Поверх",
    "Поверховість",
    "Загальна площа",
  ],
  Магазин: ["Ціна", "Поверх", "Поверховість", "Загальна площа"],
  "Окрема Будівля Ціла будівля": [
    "Ціна",
    "Поверх",
    "Поверховість",
    "Загальна площа",
  ],
  СТО: ["Ціна", "Загальна площа"],
  АЗС: ["Ціна", "Загальна площа"],
  Автомийка: ["Ціна", "Загальна площа"],
  "Паркомісце/Гараж": ["Ціна", "Площа"],
  Квартира: ["Ціна", "Кіл.кімнат", "Ремонт", "Поверх", "Загальна площа"],
  Будинок: ["Ціна", "Поверховість", "Загальна площа", "Кіл.кімнат", "Ремонт"],
};
